Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་སྤངས་པ་ཡིན། གཞན་ཡང་ལོག་པར་ལྟ་བ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན། ལོག་པར་ལྟ་བ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་ལོག་པར་ལྟ་བ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན་ཏེ།
en: They praise abstention from wrong views [and so forth], and they praise and take empathetic delight in others abstaining from wrong views [and so forth].

source: ཚུལ་ཁྲིམས་དེས་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་གང་ལ་ཡང་ཆགས་པར་མི་འགྱུར་ན། གཞན་མན་ཆད་ལྟ་ལ་ཅི་སྨོས་ཏེ།
en: Through this ethical discipline, since they are not attached even to the attributes of the śrāvakas or pratyekabuddhas, how much less to any other.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of ethical discipline.” {

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: V: 99} “Blessed Lord, how will bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of tolerance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་སྐྱེས་ཏེ། དེ་འདི་སྙམ་དུ་འདི་ལ་ཆོས་གང་ཡང་སྐྱེ་བ་འམ། འགག་པ་འམ། འབྱུང་བ་འམ། འཇིག་པ་འམ། འཆིང་བ་འམ། གཤེ་བ་འམ། འཁྱལ་བ་འམ། གཅད་པ་འམ། གཏུབ་པ་འམ། རྡེག་པ་མེད་དོ་སྙམ་པས་དེ་ལ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ།
en: In this regard, Subhūti,” replied the Blessed One, “while bodhisattva great beings dwell in the perfection of wisdom, there is a corresponding patient acceptance that arises, and they think, ‘There is nothing at all here that arises, ceases, originates, or perishes, and nothing that is fettered, reprimanded, rebuked, cut, pierced, or injured.’

source: སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་དྲུང་དུ་ལྷགས་ནས་སྤྱོས་ཏེ་ཀྱལ་ཏམ། རྡོ་དབྱུག་གིས་བརྡེགས་སམ། མཚོན་གྱིས་བཏབ་སྟེ། བཅད་གཏུབས་ཀྱང་དེ་ལ་འདི་སྙམ་སྟེ། ཀྱེ་མ་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Therefore, starting from the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment, if all beings were to approach them and reprimand or rebuke them, hitting them with stones and clubs, striking them with weapons, or even cutting off [their limbs], in that case they would think, ‘Oh, how wonderful is this, the reality of all phenomena!

source: འདི་ལ་ཆོས་གང་ལ་ཡང་སྤྱོ་བ་འམ་ཀྱལ་པ་འམ། གཅད་པ་འམ། གཏུབ་པ་འམ། བརྡེག་པ་འམ། བཅིང་བ་མེད་དོ་སྙམ་སྟེ།
en: In this [reality], there is nothing at all that is reprimanded, rebuked, cut, pierced, injured, or fettered.’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of tolerance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of perseverance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ལ་གནས་ཏེ། ཐབས་མཁས་པ་དང་ལྡན་པས་ལུས་དང་སེམས་ཀྱི་བརྩོན་པ་བསྐྱེད་དེ། དེ་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་གམ། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་འམ། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་ངམ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of wisdom, maintain the four supports for miraculous ability.

source: འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་བར་དག་ཏུ་སོང་སྟེ། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཅིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་འགོད་དོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: With skill in means they develop physical and mental perseverance, traversing a single world system, a hundred world systems, a thousand world systems, or anything up to a hundred billion trillion world systems, and they teach the Dharma to beings, establishing them in the perfection of generosity, and establishing them in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་འགོད་དོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་རབ་ཏུ་འགོད་དོ། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་རབ་ཏུ་འགོད་དོ།
en: They establish beings in the applications of mindfulness, and in [the other causal attributes], up to and including the noble eightfold path.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་དོ།
en: They establish them in the fruit of entering the stream to nirvāṇa, and in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་དོ། །དེ་ཡང་ཅི་ནས་ཀྱང་འདུས་བྱས་ཀྱི་ཁམས་ལ་རབ་ཏུ་བཀོད་པ་ཡང་མ་ཡིན། འདུས་མ་བྱས་ཀྱི་ཁམས་ལ་རབ་ཏུ་བཀོད་པ་ཡང་མ་ཡིན་པ་དེ་ལྟར་རབ་ཏུ་འགོད་དེ།
en: They establish them in unsurpassed, complete enlightenment, but in such a way that they are by no means secured in conditioned elements or in unconditioned elements. {

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: Ki.V: 100} It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of perseverance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of meditative concentration?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་མ་གཏོགས་པར། ཉན་ཐོས་ཀྱི་ཏིང་ངེ་འཛིན་ཏམ། རང་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་ཏམ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཀྱང་རུང་སྟེ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of wisdom, may become absorbed in the meditative stabilities of the śrāvakas, in the meditative stabilities of the pratyekabuddhas, or in the meditative stabilities of the bodhisattvas—in all those meditative stabilities except the meditative stabilities of the tathāgatas.

source: ཏིང་ངེ་འཛིན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་སྟེ། ཏིང་ངེ་འཛིན་དེ་དག་ལ་གནས་ཤིང་། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་ལུགས་དང་འཐུན་པ་དང་།
en: Abiding in those meditative stabilities, they may become absorbed in and arise from the eight aspects of liberation, either sequentially or in reverse order.

source: ལུགས་དང་མི་མཐུན་པར་སྙོམས་པར་འཇུག་ཅིང་རྣམ་པར་ལྡང་ངོ་། །བརྒྱད་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་ཅན་གྱིས་གཟུགས་རྣམས་མཐོང་བ་འདི་ནི་རྣམ་པར་ཐར་པ་དང་པོའོ།
en: If you ask what are these eight, Subhūti, they are as follows: The first aspect of liberation ensues when bodhisattva great beings as corporeal beings observe physical forms.

source: །ནང་གཟུགས་མེད་པའི་འདུ་ཤེས་དང་ལྡན་པས། ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་མཐོང་བ་འདི་ནི་རྣམ་པར་ཐར་པ་གཉིས་པའོ།
en: The second aspect of liberation ensues when formless beings endowed with internal perception observe external physical forms.

source: བཟང་བར་མོས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་གསུམ་པའོ།
en: The third aspect of liberation ensues when beings are inclined toward pleasant states.

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་ཞེས་ཏེ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བཞི་པའོ། །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: The fourth aspect of liberation ensues when the perceptions of physical forms have been completely transcended in all respects, when the perceptions of obstructed phenomena have subsided, and the mind does not engage with diverse perceptions, so that one achieves and dwells in the sphere of infinite space, thinking, ‘Space is infinite.’

source: རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་ཞེས་ཏེ། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་ལྔ་པའོ། །དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: The fifth aspect of liberation ensues when the sphere of infinite space has been completely transcended in all respects, and one achieves and dwells in the sphere of infinite consciousness, thinking, ‘Consciousness is infinite.’

source: ཅུང་ཟད་མ་ཡོད་དོ་ཞེས་ཆུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་དྲུག་པའོ།
en: The sixth aspect of liberation ensues when the sphere of infinite consciousness has been completely transcended in all respects, and one achieves and dwells in the sphere of nothing-at-all, thinking, ‘There is nothing at all.’

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་པ་སྟེ།
en: The eighth aspect of liberation ensues when the sphere of neither perception nor nonperception has been completely transcended in all respects, and one achieves and dwells in the cessation of all perceptions and feelings.

source: དེ་ལྟར་ན་རྣམ་པར་ཐར་པ་བརྒྱད་པོ་འདི་དག་ལ་ལུགས་དང་འཐུན་པ་དང་། ལུགས་དང་མི་མཐུན་པར་སྙོམས་པར་འཇུག་ཅིང་རྣམ་པར་ལྡང་ངོ་།
en: They may become absorbed in and arise from these eight aspects of liberation, both sequentially and in the reverse order. “

source: །མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་ལུགས་དང་མཐུན་པ་དང་། ལུགས་དང་མི་མཐུན་པར་སྙོམས་པར་འཇུག་ཅིང་རྣམ་པར་ལྡང་སྟེ།
en: Similarly, they may become absorbed in and arise from the nine serial steps of meditative absorption, either sequentially or in reverse order.

source: དགུ་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ།
en: If you ask what are these nine, Subhūti, they are as follows: (1) Bodhisattva great beings achieve and maintain the first meditative concentration, which is free from the desires [of the senses], free from negative and nonvirtuous attributes, and endowed with ideation {Ki.

source: དཔྱོད་པ་དང་བཅས་པ།
en: V: 101} and scrutiny, alongside the joy and bliss that arise from that freedom. (

source: དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་དཔྱོད་པ་ཉེ་བར་ཞི་ནས་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས། རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: 2) They achieve and maintain the second meditative concentration when there is an intense inner clarity consequent on the calming of ideation and scrutiny—the absence of ideation and the absence of scrutiny being due to one-pointed mental focus—while the joy and bliss that arise from meditative stability are present. (

source: །དེ་དགའ་བ་ལས་འདོད་ཆགས་དང་བྲལ་བས་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་བཏང་སྙོམས་སུ་གནས་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: 3) They achieve and maintain the third meditative concentration free from joy, abiding in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present, and bliss is still experienced by the body.

source: དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་བདེ་བ་དེ་ཡང་སྤངས། སྡུག་བསྔལ་བ་ཡང་སྤངས་ཤིང་།
en: 4) They achieve and maintain the fourth meditative concentration, when even that sense of bliss is abandoned, and suffering has also been eliminated.

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་ལས་ཡང་དགེ་བར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་ཡིད་ལ་མི་བྱེད་པས། ནམ་མཁའ་མཐའ་ཡས་སོ་ཞེས་ཏེ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: 5) They achieve and maintain the sphere of infinite space when the perceptions of physical forms have been completely transcended in all respects, the perceptions of obstructed phenomena have subsided, the mind does not engage with diverse perceptions, and they thereby think, ‘Space is infinite.’ (

source: རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་ཞེས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: 6) They achieve and maintain the sphere of infinite consciousness when the sphere of infinite space has been completely transcended in all respects, and they think, ‘Consciousness is infinite.’ (

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: 9) They achieve and maintain the cessation of all perceptions and feelings when the sphere of neither perception nor nonperception has been completely transcended in all respects.

source: །དེ་ལྟར་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་པོ་དེ་དག་ལ་ལུགས་དང་འཐུན་པ་དང་། ལུགས་དང་མི་མཐུན་པར་སྙོམས་པར་འཇུག་ཅིང་རྣམ་པར་ལྡང་ངོ་།
en: They may become absorbed in and arise from these nine serial steps of meditative absorption, both sequentially and in the reverse order. “

source: །དེ་རྣམ་པར་ཐར་པ་བརྒྱད་པོ་དེ་དག་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་པོ་དེ་དག་རྣམ་པར་ཕྱེ་ཞིང་། སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་གོ །
en: After differentiating these eight aspects of liberation and the nine serial steps of meditative absorption, they may become absorbed in the meditative stability known as the yawning lion. {Ki.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་དེ་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ།
en: V: 102} Subhūti, if you ask what is the meditative stability known as the yawning lion, which bodhisattva great beings may experience, at this point, Subhūti, bodhisattva great beings will have achieved and maintained the first meditative concentration, where there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from that freedom.

source: དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །བསམ་གཏན་དང་པོ་ལས་ལངས་ནས་བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that first meditative concentration and become absorbed in the second meditative concentration.

source: བསམ་གཏན་གཉིས་པ་ལས་ལངས་ནས། བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that second meditative concentration and become absorbed in the third meditative concentration.

source: བསམ་གཏན་གསུམ་པ་ལས་ལངས་ནས། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that third meditative concentration and become absorbed in the fourth meditative concentration.

source: བསམ་གཏན་བཞི་པ་ལས་ལངས་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that fourth meditative concentration and become absorbed in the sphere of infinite space.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ལངས་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of infinite space and become absorbed in the sphere of infinite consciousness.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ལངས་ནས། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of infinite consciousness and become absorbed in the sphere of nothing-at-all.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལས་ལངས་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of nothing-at-all and become absorbed in the sphere of neither perception nor nonperception.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ལངས་ནས། འགོག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of neither perception nor nonperception, and become absorbed in cessation.

source: འགོག་པ་ལ་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: And then, [in reverse order], they arise from absorption in cessation, and become absorbed in the sphere of neither perception nor nonperception.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ལངས་ནས། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of neither perception nor nonperception and become absorbed in the sphere of nothing-at-all.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལས་ལངས་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of nothing-at-all and become absorbed in the sphere of infinite consciousness.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ལངས་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of infinite consciousness and become absorbed in the sphere of infinite space.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ལངས་ནས། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that sphere of infinite space and become absorbed in the fourth meditative concentration.

source: བསམ་གཏན་བཞི་པ་ལས་ལངས་ནས། བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that fourth meditative concentration and become absorbed in the third meditative concentration.

source: བསམ་གཏན་གསུམ་པ་ལས་ལངས་ནས། བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They then arise from that third meditative concentration and become absorbed in the second meditative concentration.

source: བསམ་གཏན་གཉིས་པ་ལས་ལངས་ནས། བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་ཏེ།
en: They then arise from that second meditative concentration and become absorbed in the first meditative concentration. “

source: དེ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་ཏིང་ངེ་འཛིན་འདི་རྣམ་པར་སྨིན་པར་བྱས་ནས། ཐོད་རྒལ་གྱི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་གོ །
en: After maturing this meditative stability of the yawning lion, they then become absorbed in the all-surpassing meditative stability.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་ཐོད་རྒལ་དེ་གང་ཞེ་ན།
en: Subhūti, if you ask what is the all-surpassing meditative stability that bodhisattva great beings experience, {Ki.

source: །བསམ་གཏན་དང་པོ་ལས་ལངས་ནས། །བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then, arising from that first meditative concentration, they achieve and maintain the second meditative concentration.

source: །བསམ་གཏན་གཉིས་པ་ལས་ལངས་ནས། བསམ་གཏན་གསུམ་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then, arising from that second meditative concentration, they achieve and maintain the third meditative concentration.

source: །བསམ་གཏན་གསུམ་པ་ལས་ལངས་ནས། བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then, arising from that third meditative concentration, they achieve and maintain the fourth meditative concentration.

source: །བསམ་གཏན་བཞི་པ་ལས་ལངས་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then, arising from that fourth meditative concentration, they achieve and maintain absorption in the sphere of infinite space.

source: །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then, arising from that absorption in the sphere of infinite space, they achieve and maintain absorption in the sphere of infinite consciousness.

source: །རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས།
en: Then, arising from that absorption in the sphere of infinite consciousness, they achieve and maintain absorption in the sphere of nothing-at-all.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then, arising from that absorption in the sphere of nothing-at-all, they achieve and maintain absorption in the sphere of neither perception nor nonperception.

source: །འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then, arising from that absorption in the sphere of neither perception nor nonperception, they achieve and maintain the cessation of perceptions and feelings. “

source: །འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་གོ །
en: And then, [in reverse order], they arise from that absorption in cessation, and become absorbed in the first meditative concentration.

source: བསམ་གཏན་དང་པོ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the first meditative concentration, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of cessation, they become absorbed in the second meditative concentration.

source: བསམ་གཏན་གཉིས་པ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the second meditative concentration, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of cessation, they become absorbed in the third meditative concentration.

source: བསམ་གཏན་གསུམ་པ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the third meditative concentration, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of cessation, they become absorbed in the fourth meditative concentration.

source: བསམ་གཏན་བཞི་པ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the fourth meditative concentration, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of cessation, they become absorbed in the absorption of the sphere of infinite space.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of the sphere of infinite space, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of cessation, they become absorbed in the absorption of the sphere of infinite consciousness.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of the sphere of infinite consciousness, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of cessation, they become absorbed in the absorption of the sphere of nothing-at-all.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of the sphere of nothing-at-all, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Then, arising from the absorption of cessation, they become absorbed in the absorption of the sphere of neither perception nor nonperception.
